#+TITLE:Logs

So this document is to hopefully help understand how qmk seems to work and to show what I did to get around certain things
It is structured into sections so you can look at whatever in a more organized way


* Compile and Structure
Alright as for organization the example they use to compile
#+BEGIN_SRC sh :exports both
cd ../keyboards/clueboard/66/rev3
ls
#+END_SRC

#+RESULTS:
| config.h |
| rev3.c   |
| rev3.h   |
| rules.mk |


Show that to compile a keyboard it goes to a folder which can store what seems any number of keyboards.

#+BEGIN_SRC sh :exports both
cd ../keyboards/clueboard
ls
#+END_SRC

#+RESULTS:
| 17         |
| 2x1800     |
| 60         |
| 66         |
| 66_hotswap |
| california |
| card       |
| info.json  |
| readme.md  |

Here there seems to be an set of keyboards with a set of layouts.
#+BEGIN_SRC sh : exports both
cd ../keyboards/clueboard/60
tree
#+END_SRC

#+RESULTS:
| .   |              |             |           |
| ├── | 60.c         |             |           |
| ├── | 60.h         |             |           |
| ├── | chconf.h     |             |           |
| ├── | config.h     |             |           |
| ├── | halconf.h    |             |           |
| ├── | info.json    |             |           |
| ├── | keymaps      |             |           |
| │   | ├──          | default     |           |
| │   | │            | ├──         | keymap.c  |
| │   | │            | └──         | readme.md |
| │   | └──          | default_aek |           |
| │   | ├──          | ├──         | keymap.c  |
| │   | └──          | └──         | readme.md |
| ├── | led.c        |             |           |
| ├── | mcuconf.h    |             |           |
| ├── | readme.md    |             |           |
| └── | rules.mk     |             |           |
|     |              |             |           |
| 3   | directories, | 14  files   |           |

What was kind of confusing for me at the start was what was under keymaps, what these keymaps

* Nimbus Numpad
So to find the directory containing the numpad code. In the root directory of the QMK there is a symbolic link called "Nimbus" This is a symbolic link that takes you into the qmk_firmware/keyboards directory. Since there is like hundreds of keyboards in there, I thought it would make it slightly easier to visit. And I think the Nimbus stuff has to be in that directory for qmk to recognize it, but I am not sure.



So the current structure of the Nimbus folder looks like this. and I will try to explain what each file does.
#+begin_src sh :exports both
tree
#+end_src

#+RESULTS:
| .   |              |         |          |
| ├── | config.h     |         |          |
| ├── | info.json    |         |          |
| ├── | keymaps      |         |          |
| │   | └──          | default |          |
| │   |              | └──     | keymap.c |
| ├── | Logs.org     |         |          |
| ├── | Nimbus.c     |         |          |
| ├── | Nimbus.h     |         |          |
| ├── | readme.md    |         |          |
| └── | rules.mk     |         |          |
|     |              |         |          |
| 2   | directories, | 8       | files    |

Basically the 2 most important files in here are config.h and keymap.c in the keymaps/default/ directory

